#!/bin/bash
# background-loop.sh

for i in 1 2 3 4 5 6 7 8 9 10       # 第一个循环
do
    echo -n "$i "
done & # 在后台运行这个循环.
       #  在第2个循环之后，将在某些时候执行
echo   #  这个'echo' 某些时候将不会显示
for i in 11 12 13 14 15 16 17 18 19 20; do    # 第二个循环
    echo -n "$i "
done
echo   #  这个'echo' 某些时候将不会显示
# =============================================================
# 期望输出的结果是:
# 1 2 3 4 5 6 7 8 9 10
# 11 12 13 14 15 16 17 18 19 20

# 然而输出的结果有可能是:
# 11 12 13 14 15 16 17 18 19 20
# 1 2 3 4 5 6 7 8 9 10
